{
  "nodes": [
    {
      "op": "null", 
      "name": "data1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "data2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "__add_symbol__0", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_broadcast_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1], 
  "node_row_ptr": [0, 1, 2, 3], 
  "heads": [[2, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [1, 2, 0]], 
    "shape": ["list_shape", [
        [2], 
        [2], 
        [2]]], 
    "dtype": ["list_int", [0, 0, 0]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32"]]
  }
}