{
  "nodes": [
    {
      "op": "null", 
      "name": "data1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "data2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "__add_symbol__0", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_broadcast_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "data4", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "__add_symbol__1", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 3, 4], 
  "node_row_ptr": [0, 1, 2, 3, 4, 5, 6], 
  "heads": [[2, 0, 0], [5, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [2, 3, 0, 4, 5, 1]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]], 
    "dtype": ["list_int", [0, 0, 0, 0, 0, 0]], 
    "shape": ["list_shape", [
        [2], 
        [2], 
        [2], 
        [3], 
        [3], 
        [3]]]
  }
}