{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_NCHW3c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add___layout_transform__", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv0_weight_OIHW3i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_sc_weight_OI8i8oHW", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[10, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv1_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv2_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0], [18, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_sc_weight_OI8i8oHW", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[29, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv1_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_3", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv2_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [37, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv1_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_4", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv2_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_sc_weight_OI8i8oHW", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[48, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv1_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm13_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm13_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_5", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv2_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm14_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm14_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_broadcast_mul_broadcast_add_relu_2", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [56, 0, 0], [65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_conv1_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm15_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm15_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu14", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_6", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_conv2_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_sc_weight_OI8i8oHW", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc18", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[67, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_3", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[71, 0, 0], [72, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu15", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_3", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_conv1_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm17_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm17_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu16", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_7", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_conv2_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu17", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_broadcast_mul_broadcast_add_relu_3", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0], [75, 0, 0], [84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "global_avg_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_global_avg_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___flatten_flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "softmax0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_softmax", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[91, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    8, 
    9, 
    11, 
    12, 
    13, 
    15, 
    16, 
    19, 
    20, 
    22, 
    23, 
    24, 
    26, 
    27, 
    28, 
    30, 
    31, 
    32, 
    34, 
    35, 
    38, 
    39, 
    41, 
    42, 
    43, 
    45, 
    46, 
    47, 
    49, 
    50, 
    51, 
    53, 
    54, 
    57, 
    58, 
    60, 
    61, 
    62, 
    64, 
    65, 
    66, 
    68, 
    69, 
    70, 
    72, 
    73, 
    76, 
    77, 
    79, 
    80, 
    81, 
    83, 
    84, 
    85, 
    89, 
    90
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93
  ], 
  "heads": [[92, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        6, 
        7, 
        8, 
        0, 
        9, 
        10, 
        11, 
        1, 
        12, 
        13, 
        0, 
        14, 
        15, 
        16, 
        1, 
        17, 
        18, 
        2, 
        0, 
        19, 
        20, 
        2, 
        21, 
        22, 
        23, 
        1, 
        24, 
        25, 
        26, 
        2, 
        27, 
        28, 
        29, 
        0, 
        30, 
        31, 
        1, 
        2, 
        32, 
        33, 
        0, 
        34, 
        35, 
        36, 
        1, 
        37, 
        38, 
        39, 
        0, 
        40, 
        41, 
        42, 
        2, 
        43, 
        44, 
        1, 
        0, 
        45, 
        46, 
        2, 
        47, 
        48, 
        49, 
        1, 
        50, 
        51, 
        52, 
        2, 
        53, 
        54, 
        55, 
        0, 
        56, 
        57, 
        3, 
        2, 
        58, 
        59, 
        3, 
        60, 
        61, 
        62, 
        0, 
        63, 
        64, 
        65, 
        3, 
        4, 
        5, 
        66, 
        67, 
        4, 
        5]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "shape": ["list_shape", [
        [1, 3, 224, 224], 
        [3, 1, 1], 
        [3, 1, 1], 
        [1, 1, 224, 224, 3], 
        [8, 1, 7, 7, 3, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 112, 112, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 56, 56, 8], 
        [8, 8, 3, 3, 8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 56, 56, 8], 
        [8, 8, 3, 3, 8, 8], 
        [8, 8, 8, 8, 1, 1], 
        [1, 8, 56, 56, 8], 
        [1, 8, 56, 56, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 56, 56, 8], 
        [8, 8, 3, 3, 8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 56, 56, 8], 
        [8, 8, 3, 3, 8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 56, 56, 8], 
        [16, 8, 3, 3, 8, 8], 
        [16, 1, 1, 8], 
        [16, 1, 1, 8], 
        [1, 16, 28, 28, 8], 
        [16, 16, 3, 3, 8, 8], 
        [16, 8, 8, 8, 1, 1], 
        [1, 16, 28, 28, 8], 
        [1, 16, 28, 28, 8], 
        [16, 1, 1, 8], 
        [16, 1, 1, 8], 
        [1, 16, 28, 28, 8], 
        [16, 16, 3, 3, 8, 8], 
        [16, 1, 1, 8], 
        [16, 1, 1, 8], 
        [1, 16, 28, 28, 8], 
        [16, 16, 3, 3, 8, 8], 
        [16, 1, 1, 8], 
        [16, 1, 1, 8], 
        [1, 16, 28, 28, 8], 
        [32, 16, 3, 3, 8, 8], 
        [32, 1, 1, 8], 
        [32, 1, 1, 8], 
        [1, 32, 14, 14, 8], 
        [32, 32, 3, 3, 8, 8], 
        [32, 16, 8, 8, 1, 1], 
        [1, 32, 14, 14, 8], 
        [1, 32, 14, 14, 8], 
        [32, 1, 1, 8], 
        [32, 1, 1, 8], 
        [1, 32, 14, 14, 8], 
        [32, 32, 3, 3, 8, 8], 
        [32, 1, 1, 8], 
        [32, 1, 1, 8], 
        [1, 32, 14, 14, 8], 
        [32, 32, 3, 3, 8, 8], 
        [32, 1, 1, 8], 
        [32, 1, 1, 8], 
        [1, 32, 14, 14, 8], 
        [64, 32, 3, 3, 8, 8], 
        [64, 1, 1, 8], 
        [64, 1, 1, 8], 
        [1, 64, 7, 7, 8], 
        [64, 64, 3, 3, 8, 8], 
        [64, 32, 8, 8, 1, 1], 
        [1, 64, 7, 7, 8], 
        [1, 64, 7, 7, 8], 
        [64, 1, 1, 8], 
        [64, 1, 1, 8], 
        [1, 64, 7, 7, 8], 
        [64, 64, 3, 3, 8, 8], 
        [64, 1, 1, 8], 
        [64, 1, 1, 8], 
        [1, 64, 7, 7, 8], 
        [64, 64, 3, 3, 8, 8], 
        [64, 1, 1, 8], 
        [64, 1, 1, 8], 
        [1, 64, 7, 7, 8], 
        [1, 64, 1, 1, 8], 
        [1, 512], 
        [1000, 512], 
        [1000], 
        [1, 1000], 
        [1, 1000]]]
  }
}